use master;
create database Kursovoy;
use Kursovoy;
create table Студенты
	([Номер зачетки]  int primary key not null CHECK ([Номер зачетки]>9999999 and [Номер зачетки]<100000000), 
	[ФИО студента] nvarchar(100), 
	[Факультет] nvarchar(50), 
	[Специальность] nvarchar(100) , 
	[Курс] int CHECK ([Курс]>0 and [Курс]<6),
	[Группа] int, 
	[Адрес] nvarchar(100), 
	[Телефон] nvarchar(50), 
	[Отработки] nvarchar(max),
	[Задолженности] nvarchar(max)); 

insert into Студенты ([Номер зачетки], [ФИО студента], [Факультет], [Специальность], [Курс], [Группа], [Адрес], [Телефон], [Отработки], [Задолженности])
	values(48492377, 'Иванов Петр Владимирович', 'ФИТ', 'ДЭиВИ', 2, 9, 'г.Могилев, ул.Советская, д.7, кв.15', '+374 29 6522934', 'лр. БД', 'Кр. Мат. программирование'),
	(48493453, 'Соколов Владимир Алекеевич', 'ФИТ', 'ПОИТ ', 3, 2, 'г.Брест, ул.Победы, д.5, кв.29', '+374 44 9366198', ' ', 'Кр. Экономика'),
	(47492474, 'Корделюк Анна Алекандровна', 'ФИТ', 'ДЭиВИ', 2, 9, 'г.Брет, ул.Екельчика, д.7, кв.72', '+374 29 8355294', '', ''),
	(48462538, 'Микулич Екатерина Витальевна', 'ФИТ', 'ИСиТ', 1, 6, 'г.Минск, ул.Победы, д.4, кв.29', '+374 29 6935253', 'лр. КЯР', ''),
	(47482725, 'Лагунович Илья Контантинович', 'ФИТ', 'ДЭиВИ', 2, 9, 'г.Могилев, ул.им.Пушкина, д.19, кв.47', '+374 29 2845934', '', ''),
	(48632365, 'Пучко Наталья Владимировна', 'ФИТ', 'ПОИТ', 1, 2, 'г.Величка, ул.Мирная, д.23, кв.65', '+374 44 9266406', '', ''),
	(47488324, 'Дюжий Алексей Леонидович', 'ФИТ', 'ИСиТ', 3, 7, 'г.Витебск, ул.Пионеркая, д.26, кв.15', '+374 29 1277354', '', ''),
	(48432439, 'Рябцев Захар Александрович', 'ФИТ', 'ПОИТ', 3, 2, 'г.Пинск, ул.Ленина, д.59, кв.14', '+374 29 2845934', '', 'кр. интернет прогрпммирование'),
	(47562764, 'Лагунович Илья Контантинович', 'ФИТ', 'ИСиТ', 2, 6, 'г.Могилев, ул.им.Пушкина, д.28, кв.36', '+374 29 2845934', 'лр.КСиС', ''),
	(48456736, 'Шкода Татьяна Михайловна', 'ФИТ', 'ДЭиВИ', 3, 10, 'г.Минск, ул.им.Пушкина, д.94, кв.20', '+374 29 2845934', '', ''),
	(49484825, 'Король Екатерина Сергеевна', 'ФИТ', 'ПОИТ', 3, 2, 'г.Могилев, ул.Победы, д.34, кв.17', '+374 29 2839564', '', ''),
	(48492953, 'Меркуль Владимир Алекеевич', 'ФИТ', 'ПОИТ ', 3, 2, 'г.Брест, ул.Победы, д.5, кв.29', '+374 44 9366198', ' ', 'Кр. Экономика'),
	(47490264, 'Бобинец Анна Алекандровна', 'ФИТ', 'ДЭиВИ', 2, 9, 'г.Брет, ул.Екельчика, д.7, кв.72', '+374 29 8355294', '', ''),
	(49362538, 'Смолькова Екатерина Витальевна', 'ФИТ', 'ИСиТ', 1, 6, 'г.Минск, ул.Победы, д.4, кв.29', '+374 29 6935253', 'лр. КЯР', ''),
	(48483225, 'Жуков Илья Контантинович', 'ФИТ', 'ДЭиВИ', 2, 9, 'г.Могилев, ул.им.Пушкина, д.19, кв.47', '+374 29 2845934', '', ''),
	(42952365, 'Садовская Наталья Владимировна', 'ФИТ', 'ПОИТ', 1, 2, 'г.Величка, ул.Мирная, д.23, кв.65', '+374 44 9266406', '', ''),
	(47430524, 'Черницов Алексей Леонидович', 'ФИТ', 'ИСиТ', 3, 7, 'г.Витебск, ул.Пионеркая, д.26, кв.15', '+374 29 1277354', '', ''),
	(48438539, 'Яцкевич Захар Александрович', 'ФИТ', 'ПОИТ', 3, 2, 'г.Пинск, ул.Ленина, д.59, кв.14', '+374 29 2845934', '', 'кр. интернет прогрпммирование'),
	(47522954, 'Рыжиков Илья Контантинович', 'ФИТ', 'ИСиТ', 2, 6, 'г.Могилев, ул.им.Пушкина, д.28, кв.36', '+374 29 2845934', 'лр.КСиС', ''),
	(48394620, 'Мухортова Татьяна Михайловна', 'ФИТ', 'ДЭиВИ', 3, 10, 'г.Минск, ул.им.Пушкина, д.94, кв.20', '+374 29 2845934', '', ''),
	(49432955, 'Скапцова Екатерина Сергеевна', 'ФИТ', 'ПОИТ', 3, 2, 'г.Могилев, ул.Победы, д.34, кв.17', '+374 29 2839564', '', ''),
	(48257453, 'Ворон Владимир Алекеевич', 'ФИТ', 'ПОИТ ', 3, 2, 'г.Брест, ул.Победы, д.5, кв.29', '+374 44 9366198', ' ', 'Кр. Экономика'),
	(47437474, 'Панова Анна Алекандровна', 'ФИТ', 'ДЭиВИ', 2, 9, 'г.Брет, ул.Екельчика, д.7, кв.72', '+374 29 8355294', '', ''),
	(48392604, 'Дубренко Екатерина Витальевна', 'ФИТ', 'ИСиТ', 1, 6, 'г.Минск, ул.Победы, д.4, кв.29', '+374 29 6935253', 'лр. КЯР', ''),
	(47423492, 'Игнатов Илья Контантинович', 'ФИТ', 'ДЭиВИ', 2, 9, 'г.Могилев, ул.им.Пушкина, д.19, кв.47', '+374 29 2845934', '', ''),
	(48633952, 'Одинцова Наталья Владимировна', 'ФИТ', 'ПОИТ', 1, 2, 'г.Величка, ул.Мирная, д.23, кв.65', '+374 44 9266406', '', ''),
	(47392745, 'Петрик Алексей Леонидович', 'ФИТ', 'ИСиТ', 3, 7, 'г.Витебск, ул.Пионеркая, д.26, кв.15', '+374 29 1277354', '', ''),
	(48297433, 'Петровский Захар Александрович', 'ФИТ', 'ПОИТ', 3, 2, 'г.Пинск, ул.Ленина, д.59, кв.14', '+374 29 2845934', '', 'кр. интернет прогрпммирование'),
	(47562920, 'Чернов Илья Контантинович', 'ФИТ', 'ИСиТ', 2, 6, 'г.Могилев, ул.им.Пушкина, д.28, кв.36', '+374 29 2845934', 'лр.КСиС', ''),
	(48206236, 'Зыкова Татьяна Михайловна', 'ФИТ', 'ДЭиВИ', 3, 10, 'г.Минск, ул.им.Пушкина, д.94, кв.20', '+374 29 2845934', '', ''),
	(49302875, 'Котова Екатерина Сергеевна', 'ФИТ', 'ПОИТ', 3, 2, 'г.Могилев, ул.Победы, д.34, кв.17', '+374 29 2839564', '', ''),
	(48396233, 'Егоров Владимир Алекеевич', 'ФИТ', 'ПОИТ ', 3, 2, 'г.Брест, ул.Победы, д.5, кв.29', '+374 44 9366198', ' ', 'Кр. Экономика'),
	(47592464, 'Субботина Анна Алекандровна', 'ФИТ', 'ДЭиВИ', 2, 9, 'г.Брет, ул.Екельчика, д.7, кв.72', '+374 29 8355294', '', ''),
	(49207228, 'Бородай Екатерина Витальевна', 'ФИТ', 'ИСиТ', 1, 6, 'г.Минск, ул.Победы, д.4, кв.29', '+374 29 6935253', 'лр. КЯР', ''),
	(48453035, 'Кабанов Илья Контантинович', 'ФИТ', 'ДЭиВИ', 2, 9, 'г.Могилев, ул.им.Пушкина, д.19, кв.47', '+374 29 2845934', '', ''),
	(43936465, 'Батейко Наталья Владимировна', 'ФИТ', 'ПОИТ', 1, 2, 'г.Величка, ул.Мирная, д.23, кв.65', '+374 44 9266406', '', ''),
	(47332524, 'Колесник Алексей Леонидович', 'ФИТ', 'ИСиТ', 3, 7, 'г.Витебск, ул.Пионеркая, д.26, кв.15', '+374 29 1277354', '', ''),
	(48374294, 'Савин Захар Александрович', 'ФИТ', 'ПОИТ', 3, 2, 'г.Пинск, ул.Ленина, д.59, кв.14', '+374 29 2845934', '', 'кр. интернет прогрпммирование'),
	(47548745, 'Крюков Илья Контантинович', 'ФИТ', 'ИСиТ', 2, 6, 'г.Могилев, ул.им.Пушкина, д.28, кв.36', '+374 29 2845934', 'лр.КСиС', ''),
	(48347240, 'Шарова Татьяна Михайловна', 'ФИТ', 'ДЭиВИ', 3, 10, 'г.Минск, ул.им.Пушкина, д.94, кв.20', '+374 29 2845934', '', ''),
	(49439662, 'Шетаков Екатерина Сергеевна', 'ФИТ', 'ПОИТ', 3, 2, 'г.Могилев, ул.Победы, д.34, кв.17', '+374 29 2839564', '', ''),
	(49457419, 'Рябцева Ирина Сергеевна', 'ФИТ', 'ИСиТ', 1, 6, 'г.Витебск, ул.Ленина, д.56, кв.17', '+374 29 9277493', '', 'С.р. Физика');


use Kursovoy;
create table Аттестация1
	([Номер зачетки] int foreign key references Студенты([Номер зачетки]), 
	[ФИО студента] nvarchar(100), 
	[Факультет] nvarchar(50),
	[Курс] int,
	[Группа] int);

INSERT INTO Аттестация1  ([Номер зачетки], [ФИО студента], [Факультет], [Курс], [Группа])
SELECT [Номер зачетки], [ФИО студента], [Факультет], [Курс], [Группа] FROM Студенты;

use Kursovoy;
create table Аттестация2
	([Номер зачетки] int foreign key references Студенты([Номер зачетки]), 
	[ФИО студента] nvarchar(100), 
	[Факультет] nvarchar(50), 
	[Курс] int,
	[Группа] int);

INSERT INTO Аттестация2  ([Номер зачетки], [ФИО студента], [Факультет], [Курс], [Группа])
SELECT [Номер зачетки], [ФИО студента], [Факультет],[Курс], [Группа] FROM Студенты;

use Kursovoy;
create table ЗачетЗима
	([Номер зачетки] int foreign key references Студенты([Номер зачетки]), 
	[ФИО студента] nvarchar(100), 
	[Факультет] nvarchar(50), 
	[Курс] int,
	[Группа] int);

INSERT INTO ЗачетЗима  ([Номер зачетки], [ФИО студента], [Факультет], [Курс], [Группа])
SELECT [Номер зачетки], [ФИО студента], [Факультет], [Курс], [Группа] FROM Студенты;

use Kursovoy;
create table ЗачетЛето
	([Номер зачетки] int foreign key references Студенты([Номер зачетки]), 
	[ФИО студента] nvarchar(100), 
	[Факультет] nvarchar(50), 
	[Курс] int,
	[Группа] int);

INSERT INTO ЗачетЛето  ([Номер зачетки], [ФИО студента], [Факультет], [Курс], [Группа])
SELECT [Номер зачетки], [ФИО студента], [Факультет], [Курс], [Группа] FROM Студенты;

use Kursovoy;
create table ЭкзаменЗима
	([Номер зачетки] int foreign key references Студенты([Номер зачетки]), 
	[ФИО студента] nvarchar(100), 
	[Факультет] nvarchar(50), 
	[Курс] int,
	[Группа] int);

INSERT INTO ЭкзаменЗима ([Номер зачетки], [ФИО студента], [Факультет], [Курс], [Группа])
SELECT [Номер зачетки], [ФИО студента], [Факультет], [Курс], [Группа] FROM Студенты;

use Kursovoy;
create table ЭкзаменЛето
	([Номер зачетки] int foreign key references Студенты([Номер зачетки]), 
	[ФИО студента] nvarchar(100), 
	[Факультет] nvarchar(50),
	[Курс] int,
	[Группа] int);

INSERT INTO ЭкзаменЛето  ([Номер зачетки], [ФИО студента], [Факультет], [Курс], [Группа])
SELECT [Номер зачетки], [ФИО студента], [Факультет], [Курс], [Группа] FROM Студенты;